#include <stdio.h>
#include <stdlib.h>
#include <Windows.h>
#include "jjuggumi.h"
#include "canvas.h"

#define DIALOG_DURATION_SEC		4

void draw(void);
void print_status(void);

// (zero-base) row행, col열로 커서 이동
void gotoxy(int row, int col) {
	COORD pos = { col,row };
	SetConsoleCursorPosition(GetStdHandle(STD_OUTPUT_HANDLE), pos);
}

// row행, col열에 ch 출력
void printxy(char ch, int row, int col) {
	gotoxy(row, col);
	printf("%c", ch);
}

void map_init(int n_row, int n_col) {
	// 두 버퍼를를 완전히 비우기
	for (int i = 0; i < ROW_MAX; i++) {
		for (int j = 0; j < COL_MAX; j++) {
			back_buf[i][j] = front_buf[i][j] = ' ';
		}
	}

	N_ROW = n_row;
	N_COL = n_col;
	for (int i = 0; i < N_ROW; i++) {
		// 대입문 이렇게 쓸 수 있는데 일부러 안 가르쳐줬음
		back_buf[i][0] = back_buf[i][N_COL - 1] = '#';

		for (int j = 1; j < N_COL - 1; j++) {
			back_buf[i][j] = (i == 0 || i == N_ROW - 1) ? '#' : ' ';
		}
	}
}

// back_buf[row][col]이 이동할 수 있는 자리인지 확인하는 함수
bool placable(int row, int col) {
	if (row < 0 || row >= N_ROW ||
		col < 0 || col >= N_COL ||
		back_buf[row][col] != ' ') {
		return false;
	}
	return true;
}

// 상단에 맵을, 하단에는 현재 상태를 출력
void display(void) {
	draw();
	gotoxy(N_ROW + 4, 0);  // 추가로 표시할 정보가 있으면 맵과 상태창 사이의 빈 공간에 출력
	print_status();
}

void draw(void) {
	for (int row = 0; row < N_ROW; row++) {
		for (int col = 0; col < N_COL; col++) {
			if (front_buf[row][col] != back_buf[row][col]) {
				front_buf[row][col] = back_buf[row][col];
				printxy(front_buf[row][col], row, col);
			}
		}
	}
}

void draw_m(void){
	for (int row = 0; row < 10; row++) {
		for (int col = 0; col < 5; col++) {
			if (front_buf[row][col] != back_buf[row][col]) {
				front_buf[row][col] = back_buf[row][col];
				printxy(front_buf[row][col], row, col);
			}
		}
	}
}

void print_status(void) {
	printf("no. of players left: %d\n", n_alive);
	for (int p = 0; p < n_player; p++) {
		printf("player %2d: %5s\n", p, player[p] ? "alive" : "DEAD");
	}
}

void dialog(char message[]) {
	int len = strlen(message);
	gotoxy(3, 7);
	for (int i = 0; i < len + 5; i++) {
		printf("*");
	}
	gotoxy(5, 7);
	for (int i = 0; i < len + 5; i++) {
		printf("*");
	}
	for (int i = 0; i < DIALOG_DURATION_SEC; i++) {
		gotoxy(4, 7);
		printf("*%d ", DIALOG_DURATION_SEC - i);
		for (int j = 0; j < len; j++) {
			printf("%c", message[j]);
		}
		printf(" *");
		Sleep(1000);
	}
	gotoxy(3, 7);
	for (int i = 0; i < len + 5; i++) {
		printf(" ");
	}
	gotoxy(5, 7);
	for (int i = 0; i < len + 5; i++) {
		printf(" ");
	}
	for (int i = 0; i < DIALOG_DURATION_SEC; i++) {
		gotoxy(4, 7);
		printf("  ");
		for (int j = 0; j < len; j++) {
			printf(" ");
		}
		printf("   ");
	}
}

// 인트로
void intro_JJU(void) {
    printf("; ::::~::~~~~~~:~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~: ~~~~~: ~: ~:::: :\n");
    printf("~,,..................... .......   .. ..   . .. .....  .   . . . ... .  .......................,,,,,\n");
    printf("~,.,............................ . ..  .   . .  . ..    .   . ..... . ...... ...................,-,,\n");
    printf("~,.,.,..............................  . .. . ..    .  ..   ...;*=* ............................-=#$;\n");
    printf("~.....,,,,,,,,,,......... ... .. .... .  .. .    . .      .  .###=..  .........................~###$\n");
    printf("~....~$##########$$$#=. .. . .  ..      .          .  .    . .###=  .. . ............. ........-####\n");
    printf("~....!@@@@@@@@@@@@@@@#.. ..            .      .              .###$.  ......  .. ...............,####\n");
    printf("~....;#@@@@@@@@@@###@$.. . .   . .                  .   ..   .###$....  .  ....................,####\n");
    printf("~....,,-,~!=@@@=**===~  ..    ..           .     .****==$$$$..####.  ..     .. ...,~!$*:... .. ,####\n");
    printf("~....,....,=$##*.....  ..   . .             .    .=*=*$$#$#=..####,. ...  .. ....-===$$#$~.....,####\n");
    printf("~.........:=$##$:. .... .. . ..,,..... ..,,..    .***!**==$$..####,  .   .  . ..~=$$$=*$##:....,####\n");
    printf("~........,$$$=$#*... ..   . .=@####$$$$#####$~   .=*;    ==$. $###,   .   . .  .*===:,:=##$....,####\n");
    printf("~........;$#$=$#$*. ...     ,#@##############=   .**!    *==. =###,      .   ..:===,...,*$$;...,####\n");
    printf(":.......,=$$=~=#$=-. .      .$###############=   .!*!    =$$. =###,    .  .  ..!#=-.....~$#*....####\n");
    printf(":.......*=$$;.;$$$*.. .    . ;$#$$####!;;;$##*   .==!    $$$. =###,  .      . .*$$,.....,##=....$###\n");
    printf(":......-$$$$;!;$#$@:  ...    . .. ;###,  .###*   .$=$=$*$#$=. *###,          ..*=#- ....-$#=....$###\n");
    printf(":......=$#==$$=$###$..    ..      !###,  ,###*   .=$##$$$##$. *###.       ..  .;$#=,.. ,=##;....$###\n");
    printf(":,....~$#$$##=$###$$;.            !###,  -###*   .==$$==*===. *##$.        .  .,$$#=:-:*$==,....$###\n");
    printf(":,....!****=!*=======.. .         !###,  :###*                *##$. .       ....~#$$#$$$$=~....,$#$#\n");
    printf(":,......... ...,,,,,...   .       *###,  :###=                *##$.             .~#$#$$@$:.....,$###\n");
    printf("!@#$$$=$$$$$$$##@@####$,          =###,  :###$            ....-::;...   ...  ...  ,:*=*:,......,$###\n");
    printf("!@@@@@@@@@@@@@@@@@@@@@@~.        .$###-  -****.             ,....  ..... .....  .......,,,,,.,,.:!!!\n");
    printf("!@@@@@@@@@@@@@@@@@@@@@@;           -::,   .,..             ,####$!:::,...::..$=;......$##########$*.\n");
    printf(":!;!~~~;!*=@@@@=!;;;::~.~****!;:~,,,,,,,,-----..           ,########=..$##!.,###-. ...$############.\n");
    printf("~.........-@@@@-. .   . =######################.           ,########,..$##;.,###-.. ..$#####$$#####.\n");
    printf("~.......  ,@@@@-    .  .=######################-           .$#$$####- .$##; ,###,. ...$##:,.,,,~###.\n");
    printf("~.........-@@@@-.  ..   ~###======$####$======!.            ..  ###!. ,###: -###, . ..$##~.....,###.\n");
    printf("~.........,@@@@~. . .  . ....     ;####*                      .-###*!!!###; -###.  . .$##~......$##.\n");
    printf("~..........*$$$-. .    .          ~####=                      .=##########* ~###......$##:......$##.\n");
    printf("~...... ......  ....          .   .####=.                     ,$##########* ~###..  ..$##~.....,$## \n");
    printf("~............. .....  ....         =###=                     .,##*::~~:###* ~###.. ...$$#~......$##.\n");
    printf("~.........................         *###=                    ..-#$.    .###* -###......$##!~~~~--$##.\n");
    printf("-.........  ..,..  .,..  ..,.      ~$##!                    ..##~     ,###* ,###..  ..$############.\n");
    printf("-.........  ..,..  ....  ..,..      .,,                     .,#=.     ,###* ,###......$############.\n");
    printf("~................................                          -.:#:      .###~ ,###,. ...$############.\n");
    printf("~....... ..... .....  ..... .... .   .                    . .$$.       ,,-. .###,.....=#####$$=*$$$.\n");
    printf("~......  ..,.   .,..  ..,.   .,..  . .                    . ~#*..    ..   ..,###, ....-~-,.  .,,..  \n");
    printf("~............. ..... ...... ..... . ..                    ..$#-     ..  . . ,###. ......... ...... .\n");
    printf("~......................................                   .:#*.    . . .... ~###,....... ...........\n");
    printf("-... .....  ..,..  .,,.  ..,.   .,..  ..            .     .:*,   .....  .. .;###,........ .,..  ..,.\n");
    printf("~.........  ..,..  ....  ..,..  ....  ... . . .         . .       . .  .....*#$#,........ ....  ..,.\n");
    printf("~....................................      .     .  .   ..   . ..  . .......*###,...................\n");
    printf("~....... ..... .....  ....  .....  ...   .     ...    .   . ... .. .. ......~*!:..... ..,..  ....  .\n");
    printf("~......  ..,.   .,..  ..,.   .,..  ..   ..       .    .. ..    ......... ............. .,..  ..,.   \n");
    printf(";~~~~~~~~~~~~~~~~~~~::~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~:~~~~~~~~~~~~~~~~~\n");
    Sleep(2000);
    system("cls");
}
void intro_op(void) {
    intro_JJU();
    printf("\n");
    printf(" 반갑습니다 ");
    for (int i = 1; i < 6; i++) {
        printf("."); Sleep(200);
    }
    printf(" 참가자 여러분들!\n");
    Sleep(800);
    printf(" 게임에서 승리하시고 상금 차지하세요!!!\n");
    for (int i = 1; i < 5; i++) {
        printf(". \n"); Sleep(500);
    }
    printf("\n\n");
    printf("\"엔터를 누르시면 게임이 시작됩니다\"");
    printf("\n");

    char get = getchar();
    get = getchar();
    system("cls");


}


// 엔딩 
void ending() {
    printf("                      제한시간 초과로 인해  \"무궁화 꽃이 피었습니다.\"는 끝났습니다!\n ");
    printf("                     게임을 이긴 참가자분들은 다음 게임으로 속히 이동해 주시길 바라겠습니다.");

}

// 즉시종료 엔딩
void game_q() {
    system("cls");
    for (int row = 0; row <= 0; row++) {
        for (int col = 54; col < 64; col++) {
            gotoxy(row, col);
            printf("#");
        }
    }
    gotoxy(1, 54);
    printf("#");
    gotoxy(1, 55);
    printf("스탑!");
    gotoxy(1, 63);
    printf("#");
    for (int row = 2; row <= 2; row++) {
        for (int col = 54; col < 64; col++) {
            gotoxy(row, col);
            printf("#");
        }
    }
    printf("\n");
}

